#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_BUFFERQUEUE_V1_0_IGRAPHICBUFFERPRODUCER_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_BUFFERQUEUE_V1_0_IGRAPHICBUFFERPRODUCER_H

#include <android/hardware/graphics/bufferqueue/1.0/IProducerListener.h>
#include <android/hardware/graphics/common/1.0/types.h>
#include <android/hardware/media/1.0/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace bufferqueue {
namespace V1_0 {

struct IGraphicBufferProducer : public ::android::hidl::base::V1_0::IBase {
    typedef android::hardware::details::i_tag _hidl_tag;

    // Forward declaration for forward reference support:

    /**
     * Ref: frameworks/native/include/gui/IGraphicBufferProducer.h:
     *      IGraphicBufferProducer
     * This is a wrapper/wrapped HAL interface for the actual binder interface.
     */
    // Forward declaration for forward reference support:
    struct FenceTimeSnapshot;
    struct FrameEventsDelta;
    struct CompositorTiming;
    struct FrameEventHistoryDelta;
    enum class DisconnectMode : int32_t;
    struct QueueBufferInput;
    struct QueueBufferOutput;

    /**
     * Type for return values of functions in IGraphicBufferProducer.
     */
    typedef int32_t Status;

    /**
     * Ref: frameworks/native/include/ui/FenceTime.h: FenceTime::Snapshot
     * 
     * An atomic snapshot of the FenceTime that is flattenable.
     */
    struct FenceTimeSnapshot final {
        // Forward declaration for forward reference support:
        enum class State : int32_t;

        enum class State : int32_t {
            EMPTY = 0,
            FENCE = 1, // (::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot::State.EMPTY implicitly + 1)
            SIGNAL_TIME = 2, // (::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot::State.FENCE implicitly + 1)
        };

        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot::State state __attribute__ ((aligned(4)));
        ::android::hardware::hidl_handle fence __attribute__ ((aligned(8)));
        int64_t signalTimeNs __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot, state) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot, fence) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot, signalTimeNs) == 24, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot) == 32, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot) == 8, "wrong alignment");

    /**
     * Ref: frameworks/native/include/gui/FrameTimestamp.h: FrameEventsDelta
     * 
     * A single frame update from the consumer to producer that can be sent
     * through a HIDL interface. Although this may be sent multiple times for
     * the same frame as new timestamps are set, Fences only need to be sent
     * once.
     */
    struct FrameEventsDelta final {
        uint32_t index __attribute__ ((aligned(4)));
        uint64_t frameNumber __attribute__ ((aligned(8)));
        bool addPostCompositeCalled __attribute__ ((aligned(1)));
        bool addRetireCalled __attribute__ ((aligned(1)));
        bool addReleaseCalled __attribute__ ((aligned(1)));
        int64_t postedTimeNs __attribute__ ((aligned(8)));
        int64_t requestedPresentTimeNs __attribute__ ((aligned(8)));
        int64_t latchTimeNs __attribute__ ((aligned(8)));
        int64_t firstRefreshStartTimeNs __attribute__ ((aligned(8)));
        int64_t lastRefreshStartTimeNs __attribute__ ((aligned(8)));
        int64_t dequeueReadyTime __attribute__ ((aligned(8)));
        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot gpuCompositionDoneFence __attribute__ ((aligned(8)));
        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot displayPresentFence __attribute__ ((aligned(8)));
        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot displayRetireFence __attribute__ ((aligned(8)));
        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FenceTimeSnapshot releaseFence __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, index) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, frameNumber) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, addPostCompositeCalled) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, addRetireCalled) == 17, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, addReleaseCalled) == 18, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, postedTimeNs) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, requestedPresentTimeNs) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, latchTimeNs) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, firstRefreshStartTimeNs) == 48, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, lastRefreshStartTimeNs) == 56, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, dequeueReadyTime) == 64, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, gpuCompositionDoneFence) == 72, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, displayPresentFence) == 104, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, displayRetireFence) == 136, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta, releaseFence) == 168, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta) == 200, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta) == 8, "wrong alignment");

    /**
     * Ref: frameworks/native/include/gui/FrameTimestamp.h: CompositorTiming
     * 
     * The most recent compositor timing info sent from consumer to producer
     * through a HIDL interface.
     */
    struct CompositorTiming final {
        int64_t deadlineNs __attribute__ ((aligned(8)));
        int64_t intervalNs __attribute__ ((aligned(8)));
        int64_t presentLatencyNs __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming, deadlineNs) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming, intervalNs) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming, presentLatencyNs) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming) == 8, "wrong alignment");

    /**
     * Ref: frameworks/native/include/gui/FrameTimestamp.h: FrameEventHistoryDelta
     * 
     * A collection of updates from consumer to producer that can be sent
     * through a HIDL interface.
     */
    struct FrameEventHistoryDelta final {
        ::android::hardware::hidl_vec<::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventsDelta> deltas __attribute__ ((aligned(8)));
        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::CompositorTiming compositorTiming __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta, deltas) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta, compositorTiming) == 16, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta) == 40, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta) == 8, "wrong alignment");

    /**
     * Modes for disconnection.
     */
    enum class DisconnectMode : int32_t {
        /**
         * Disconnect only the specified API.  */
        API = 0,
        /**
         * Disconnect any API originally connected from the process calling
         *  disconnect.  */
        ALL_LOCAL = 1, // (::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::DisconnectMode.API implicitly + 1)
    };

    struct QueueBufferInput final {
        int64_t timestamp __attribute__ ((aligned(8)));
        int32_t isAutoTimestamp __attribute__ ((aligned(4)));
        ::android::hardware::graphics::common::V1_0::Dataspace dataSpace __attribute__ ((aligned(4)));
        ::android::hardware::media::V1_0::Rect crop __attribute__ ((aligned(4)));
        int32_t scalingMode __attribute__ ((aligned(4)));
        uint32_t transform __attribute__ ((aligned(4)));
        uint32_t stickyTransform __attribute__ ((aligned(4)));
        ::android::hardware::hidl_handle fence __attribute__ ((aligned(8)));
        ::android::hardware::hidl_vec<::android::hardware::media::V1_0::Rect> surfaceDamage __attribute__ ((aligned(8)));
        bool getFrameTimestamps __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, timestamp) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, isAutoTimestamp) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, dataSpace) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, crop) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, scalingMode) == 32, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, transform) == 36, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, stickyTransform) == 40, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, fence) == 48, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, surfaceDamage) == 64, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput, getFrameTimestamps) == 80, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput) == 88, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferInput) == 8, "wrong alignment");

    struct QueueBufferOutput final {
        uint32_t width __attribute__ ((aligned(4)));
        uint32_t height __attribute__ ((aligned(4)));
        uint32_t transformHint __attribute__ ((aligned(4)));
        uint32_t numPendingBuffers __attribute__ ((aligned(4)));
        uint64_t nextFrameNumber __attribute__ ((aligned(8)));
        bool bufferReplaced __attribute__ ((aligned(1)));
        ::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::FrameEventHistoryDelta frameTimestamps __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, width) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, height) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, transformHint) == 8, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, numPendingBuffers) == 12, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, nextFrameNumber) == 16, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, bufferReplaced) == 24, "wrong offset");
    static_assert(offsetof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput, frameTimestamps) == 32, "wrong offset");
    static_assert(sizeof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput) == 72, "wrong size");
    static_assert(__alignof(::android::hardware::graphics::bufferqueue::V1_0::IGraphicBufferProducer::QueueBufferOutput) == 8, "wrong alignment");

    virtual bool isRemote() const override { return false; }


    using requestBuffer_cb = std::function<void(int32_t status, const ::android::hardware::media::V1_0::AnwBuffer& buffer)>;
    /**
     * requestBuffer requests a new buffer for the given index. The server (i.e.
     * the IProducerListener implementation) assigns the newly created
     * buffer to the given slot index, and the client is expected to mirror the
     * slot->buffer mapping so that it's not necessary to transfer an
     * AnwBuffer for every dequeue operation.
     * 
     * The slot must be in the range of [0, NUM_BUFFER_SLOTS).
     * 
     * Return of a value other than NO_ERROR means an error has occurred:
     * * NO_INIT - the buffer queue has been abandoned or the producer is not
     *             connected.
     * * BAD_VALUE - one of the two conditions occurred:
