<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Networks</key>
	<array>
		<string>net</string>
	</array>
	<key>Version</key>
	<string>1.0.9</string>
	<key>net</key>
	<dict>
		<key>Inputs</key>
		<array>
			<string>data</string>
		</array>
		<key>Outputs</key>
		<array>
			<string>output@output</string>
		</array>
		<key>Units</key>
		<array>
			<string>output</string>
		</array>
		<key>Weights</key>
		<array>
			<string>/private/var/folders/l8/38vj8bm52_gfgsqgdn__sh2w0000gn/T/tmpm7rb6ba9.mlmodelc/model.espresso.weights</string>
			<string>net.additional.weights</string>
		</array>
		<key>data</key>
		<dict>
			<key>BatchSize</key>
			<integer>1</integer>
			<key>InputChannels</key>
			<integer>1</integer>
			<key>InputHeight</key>
			<integer>1</integer>
			<key>InputInterleave</key>
			<integer>1</integer>
			<key>InputPlaneStride</key>
			<integer>64</integer>
			<key>InputRowStride</key>
			<integer>64</integer>
			<key>InputType</key>
			<string>Float16</string>
			<key>InputWidth</key>
			<integer>6</integer>
		</dict>
		<key>output</key>
		<dict>
			<key>Bottom</key>
			<string>data</string>
			<key>Name</key>
			<string>output</string>
			<key>OutputType</key>
			<string>Float16</string>
			<key>Params</key>
			<dict>
				<key>BiasScalar</key>
				<integer>16354</integer>
				<key>ScaleScalar</key>
				<integer>20544</integer>
			</dict>
			<key>Type</key>
			<string>GOC</string>
			<key>UnescapedBottom</key>
			<string>data</string>
			<key>UnescapedName</key>
			<string>output</string>
		</dict>
		<key>output@output</key>
		<dict>
			<key>Bottom</key>
			<string>output</string>
			<key>OutputInterleave</key>
			<integer>1</integer>
			<key>OutputPlaneStride</key>
			<integer>64</integer>
			<key>OutputRowStride</key>
			<integer>64</integer>
			<key>OutputType</key>
			<string>Float16</string>
		</dict>
	</dict>
</dict>
</plist>
