tap "esolitos/ipa"
tap "homebrew/cask"
tap "homebrew/core"
tap "khell/srm"
brew "openssl@3"
brew "aircrack-ng"
brew "lz4"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "llvm"
brew "freetype"
brew "gettext"
brew "harfbuzz"
brew "openjdk"
brew "apktool"
brew "autoconf"
brew "automake"
brew "awk"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "binwalk"
brew "boom-completion"
brew "boost"
brew "boxes"
brew "bpytop"
brew "ccrypt"
brew "cheat"
brew "checkmake"
brew "chkrootkit"
brew "cmake"
brew "cmake-docs"
brew "cmark"
brew "cmatrix"
brew "coreutils"
brew "cpufetch"
brew "cracklib"
brew "create-dmg"
brew "cvs"
brew "dmg2img"
brew "perl"
brew "dpkg"
brew "dsvpn"
brew "duf"
brew "emojify"
brew "exif"
brew "fribidi"
brew "libevent"
brew "gnutls"
brew "openjpeg"
brew "sdl2"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "glances"
brew "glew"
brew "libgcrypt"
brew "libusb"
brew "gnupg"
brew "pkgconf"
brew "gping"
brew "libtool"
brew "graphicsmagick"
brew "gsl"
brew "gtk+3"
brew "xxhash"
brew "hashcat"
brew "htop"
brew "httpie"
brew "libplist"
brew "libusbmuxd"
brew "libimobiledevice"
brew "libzip"
brew "ideviceinstaller"
brew "libomp", link: true
brew "imagemagick"
brew "ipsw"
brew "john"
brew "jp2a"
brew "jpeg"
brew "ldid"
brew "libicns"
brew "libmagic"
brew "libpcap"
brew "librsvg"
brew "libxml2"
brew "lolcat"
brew "lsusb"
brew "make"
brew "mawk"
brew "miniupnpc"
brew "mobiledevice"
brew "mplayer"
brew "nano"
brew "nasm"
brew "neovim"
brew "netcat"
brew "nmap"
brew "node"
brew "procs"
brew "pwncat"
brew "py3cairo"
brew "pygments"
brew "pygobject3"
brew "python-tk@3.10"
brew "python-tk@3.11"
brew "python-tk@3.9"
brew "scrub"
brew "shellcheck"
brew "six"
brew "speedtest-cli"
brew "subversion"
brew "telnet"
brew "tiff2png"
brew "timedog"
brew "timelimit"
brew "tldr"
brew "tmux"
brew "tor"
brew "tree"
brew "tty-clock"
brew "ttygif"
brew "watch"
brew "websocketd"
brew "wget"
brew "wifi-password"
brew "yasm"
brew "yt-dlp", link: false
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zzuf"
brew "esolitos/ipa/sshpass"
brew "khell/srm/srm"
cask "gcc-arm-embedded"
cask "ghidra"
cask "hyper"
cask "temurin"
cask "vscodium"
cask "xquartz"
